01 	REC-TEST.
	02 ORDERING PIC 9(6).
	02 TRANSACTION-REFERENCE-NUMBER PIC X(16).
	02 BATCH-IDENTIFICATION PIC X(16).
	02 BATCH-SEQUENCE-NUMBER PIC 9(6).
	02 CURRENCY-CODE  PIC X(3).
	02 VALUE-DATE-DEBIT PIC 9(8).
	02 CREDIT-AMOUNT PIC S9(15).
	02 BC-NUMBER-BENEFICIARY-BANK PIC 9(6).
	02 SETTLEMENT-MESSAGE-REQUIRED PIC 9.
	02 PRIORITY-CODE PIC XX.
	02 ORDERING-CUSTOMER-ACCOUNT-NUMBER.
/* MUST BE THERE IF FIELD 32F IS THERE. */
		03 CODE-IDENTIFICATION PIC X(35).
		03 IBAN PIC X(34).
		03 ORDERING-PARTY-ADDRESS.
			04 FULL-ADDRESS-1 PIC X(34).
			04 FULL-ADDRESS-2 PIC X(34).
			04 FULL-ADDRESS-3 PIC X(34).
			04 FULL-ADDRESS-4 PIC X(34).
		03 NAME-ADDRESS PIC X34 OCCURS 4 TIMES.
		03 SWIFT-BIC PIC X(11).
/* SENDER'S ACCOUNT NUMBER. IF FIELD 35 IS PRESENT, THEN FIELD 36 MUST ALSO BE PRESENT */
		03 ACCOUNT-NUMBER PIC X(34).
		03 IBAN-NUMBER PIC X(34).
/* SENDER'S ADDRESS. FIELD 36 SHOULD ONLY BE USED IF THE ORIGINAL ORDERING FINANCIAL INSTITUTION IS ONE OTHER THAN THE A-BANK */
		03 FULL-ADDRESS PIC X(35) OCCURS 4 TIMES.
/* INTERMEDIARY FINANCIAL INSTITUTION'S ACCOUNT NO. IF FIELD 39 IS PRESENT, THEN FIELD 40 MUST ALSO BE PRESENT. */
/* BENEFICIARY'S ACCOUNT */
	02 BENEFICIARY.
		03 ACCOUNT-NUMBER  PIC X(34).
		03 BENEFICIARY-POST-ACCOUNT-NUMBER PIC 9(9).
		03 REFERENCE-NUMBER PIC 9(27).
		03 IBAN PIC X(34).
/* BENEFICIARY'S ADDRESS */
		03 BENEFICIARY-ADDRESS.
			04 FULL-ADDRESS-1 PIC X(34).
			04 FULL-ADDRESS-2 PIC X(34).
			04 FULL-ADDRESS-3 PIC X(34).
			04 FULL-ADDRESS-4 PIC X(34).
			04 ADDRESS-FOR-PAYMENT-INSTRUCTIONS PIC X (30) OCCURS 4 TIMES.
			04 SWIFT-ADDRESS PIC X(11).
			04 BENEFICIARY-REFERENCE-NUMBER PIC X(16).
			04 MESSAGES-TO-THE-BENEFICIARY PIC X(35) OCCURS 4 TIMES.
			04 DETAILS-OF-PAYMENT-FROM  PIC X(20).
			04 REQUIRED-PROCESSING-DATE PIC 9(8).
			04 ORDERING-PARTY-PAYMEN-AMOUNT. 
				05	AMMOUNT PIC S9(8).
				05	CURRENCY PIC XXX.
				05	CURRENCY-CONVERSION-RATE PIC 99V99.
			04 FEE-OPTIONS-AND-AMOUNTS.
				05	OPTION-SHA-OUR PIC X(3).
				05  OPTION-OUR-AND-CURRENCY- PIC X(3).
	